Courses/7140/Lectures/Examples/TicTacToe-JavaFX-UnRedo/tictactoe-code.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Code Documentation of Tic-Tac-Toe with JavaFX</title>
<!-- 2016-02-06 Sat 09:11 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Prabhaker Mateti" />
<meta  name="description" content="Mateti: OO Programming and Design"
 />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="../"> UP </a>
 |
 <a accesskey="H" href="../../../Top/index.html"> HOME </a>
</div><div id="content">
<h1 class="title">Code Documentation of Tic-Tac-Toe with JavaFX</h1>
<p>
This is part of <a href="../../Examples/TicTacToe-JavaFX-UnRedo">../../Examples/TicTacToe-JavaFX-UnRedo</a>.  It describes
the src code.  It is assumed that the reader knows how JavaFX works.
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Src Code</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>JavaFX source code of TicTacToe
<ol class="org-ol">
<li><a href="./TicTacToe.java">./TicTacToe.java</a> Java src code 
</li>
<li><a href="./TicTacToe.java.html">./TicTacToe.java.html</a> Java src code colorized
</li>
<li>You can build and run it as in 
<pre class="example">
% javac TicTacToe.java; java TicTacToe
</pre>
</li>
</ol>
</li>
<li><code>sloccount TicTacToe.java</code> gives java: 109 (100.00%).
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> TicTacToe extends JavaFX Application</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li>The <code>start</code> method overrides the JavaFX provided default.  It is
indirectly invoked by the <code>launch</code> in <code>main</code>.  The argument
<code>primaryStage</code> is supplied through this mechanism.
</li>
<li><code>hasWon</code>, <code>isFull</code> are obvious
</li>
<li><code>drawX</code> draws two JavaFX lines so that they look like an X.
</li>
<li><code>drawO</code> draws a circle using the JavaFX Ellipse method.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Inner Class Named Cell extends JavaFX Pane</h2>
<div class="outline-text-2" id="text-3">
<ol class="org-ol">
<li>Note that cell is one cell of the 3x3 grid.
</li>
<li>In <code>setOnMouseClicked(e -&gt; handleMouseClick());</code>, we are using
Java8 Lambda Expression.  This says when a mouse-click happens
within the area of a cell, invoke the method named
<code>handleMouseClick</code>.  We are ignoring the details of the event <code>e</code>.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Event Listeners</h2>
<div class="outline-text-2" id="text-4">
<ol class="org-ol">
<li>The <code>main</code> method invokes <code>launch</code>.  This is typical of a JavaFX
Application.  The launch invokes <code>start</code>.  Then onwards, it is all
driven by events.
</li>
<li>The for-loop in <code>start</code> constructed Cell objects, all of which have the
same <code>handleMouseClick</code> method as their event handler.  This
handler is executing in the context of the specific Cell object
where the event occurred.
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Discussion</h2>
<div class="outline-text-2" id="text-5">
<ol class="org-ol">
<li>The code linked above has at least one bug.  Find and fix its bugs.
</li>
<li>Code smells:  Should some of those <code>public</code> methods be private?
What other bad smells do you detect?
</li>
<li>The business logic and GUI are not well separated. Revise the code.
</li>
<li>How does this program terminate?
</li>
<li>Redo the implementation of <code>whoseTurn</code> as a renamed <code>itIsXsTurn</code>
   Boolean. Does this make the code better or worse?
</li>
<li>This problem was used as a <a href="http://cecs.wright.edu/~pmateti/Courses/4180/Labs/L4.html">Lab of CEG 4180</a> OOProg + Design.  Do the
Undo/Redo.
</li>
<li>Should documentation be embedded in the source code file itself?
Perhaps following javadoc suggestions?
</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr size=1>Copyright &copy; 2015 <a href="http://www.wright.edu/~pmateti">www.wright.edu/~pmateti</a>
</div>
</body>
</html>
